org/systemd-boot.org
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="style.css" />
#+OPTIONS: author:nil date:nil creator:nil \n:t
#+TITLE: 使用systemd-boot (Arch linux)
* TL;DR
  _systemd-boot的优点_
  快速，大多数linux发行版都预置，配置简单
  _systemd-boot的缺点_
  据说某些格式的磁盘分区有问题（没遇到过）
* 创建引导程序
  #+begin_src bash
  sudo bootctl --path=/boot install
  #+end_src
** 编辑配置文件
   =/boot/loader/entries/youname.conf= 
   查看分区uuid =ls -l /dev/disk/by-partuuid= 
   #+begin_src conf
  title   Arch Linux 
  linux   /vmlinuz-linux
  initrd  /amd-ucode.img
  initrd  /initramfs-linux.img
  options root=PARTUUID=devuuid rw
   #+end_src
* 其它  
** 无法保存屏幕亮度
   尝试添加内核参数 =acpi_backlight=video= 到 =/boot/loader/entries/youname.conf= 例如
** 休眠
   1. 添加内核参数 =resume=/dev/youswap= 到 =/boot/loader/entries/youname.conf=
   2. 编辑 =/etc/mkinitcpio.conf= 添加 =resume= 到 =HOOKS= 例如
   #+begin_src conf
   options root=PARTUUID=devuuid acpi_backlight=video rw
   #+end_src
   #+begin_src conf
    HOOKS="base udev resume autodetect modconf block filesystems keyboard fsck"
   #+end_src
   3. 生成initramfs镜像 执行 =mkinitcpio -p linux=
   4. 编辑 =/etc/systemd/logind.conf= 加入 =HandleLidSwitch=hibernate #合盖休眠=
* 与本文无关/地图炮
  #+begin_quote
  2020年还在常用桌面环境使用SysVinit的无非两种人，一种是宁可牺牲速度也要让系统略微干净那么一点的，另一种就是喜欢跟风还喜欢装逼的。
  #+end_quote
