systemd-boot.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-11-23 Mon 06:04 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>使用systemd-boot (Arch linux)</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content">
<h1 class="title">使用systemd-boot (Arch linux)</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org143e4b8">TL;DR</a></li>
<li><a href="#org8939553">创建引导程序</a>
<ul>
<li><a href="#orga1cf2fd">编辑配置文件</a></li>
</ul>
</li>
<li><a href="#orgb782fc3">其它</a>
<ul>
<li><a href="#orgd0cf60a">无法保存屏幕亮度</a></li>
<li><a href="#org2cd2d4e">休眠</a></li>
</ul>
</li>
<li><a href="#orgc09f649">与本文无关/地图炮</a></li>
</ul>
</div>
</div>
<div id="outline-container-org143e4b8" class="outline-2">
<h2 id="org143e4b8">TL;DR</h2>
<div class="outline-text-2" id="text-org143e4b8">
<p>
<span class="underline">systemd-boot的优点</span><br>
快速，大多数linux发行版都预置，配置简单<br>
<span class="underline">systemd-boot的缺点</span><br>
据说某些格式的磁盘分区有问题（没遇到过）<br>
</p>
</div>
</div>
<div id="outline-container-org8939553" class="outline-2">
<h2 id="org8939553">创建引导程序</h2>
<div class="outline-text-2" id="text-org8939553">
<div class="org-src-container">
<pre class="src src-bash">sudo bootctl --path=/boot install
</pre>
</div>
</div>
<div id="outline-container-orga1cf2fd" class="outline-3">
<h3 id="orga1cf2fd">编辑配置文件</h3>
<div class="outline-text-3" id="text-orga1cf2fd">
<p>
<code>/boot/loader/entries/youname.conf</code> <br>
查看分区uuid <code>ls -l /dev/disk/by-partuuid</code> <br>
</p>
<div class="org-src-container">
<pre class="src src-conf">title   Arch Linux 
linux   /vmlinuz-linux
initrd  /amd-ucode.img
initrd  /initramfs-linux.img
options root=PARTUUID=devuuid rw
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgb782fc3" class="outline-2">
<h2 id="orgb782fc3">其它</h2>
<div class="outline-text-2" id="text-orgb782fc3">
</div>
<div id="outline-container-orgd0cf60a" class="outline-3">
<h3 id="orgd0cf60a">无法保存屏幕亮度</h3>
<div class="outline-text-3" id="text-orgd0cf60a">
<p>
尝试添加内核参数 <code>acpi_backlight=video</code> 到 <code>/boot/loader/entries/youname.conf</code> 例如<br>
</p>
</div>
</div>
<div id="outline-container-org2cd2d4e" class="outline-3">
<h3 id="org2cd2d4e">休眠</h3>
<div class="outline-text-3" id="text-org2cd2d4e">
<ol class="org-ol">
<li>添加内核参数 <code>resume=/dev/youswap</code> 到 <code>/boot/loader/entries/youname.conf</code><br></li>
<li>编辑 <code>/etc/mkinitcpio.conf</code> 添加 <code>resume</code> 到 <code>HOOKS</code> 例如<br></li>
</ol>
<div class="org-src-container">
<pre class="src src-conf">options root=PARTUUID=devuuid acpi_backlight=video rw
</pre>
</div>
<div class="org-src-container">
<pre class="src src-conf">HOOKS="base udev resume autodetect modconf block filesystems keyboard fsck"
</pre>
</div>
<ol class="org-ol">
<li>生成initramfs镜像 执行 <code>mkinitcpio -p linux</code><br></li>
<li>编辑 <code>/etc/systemd/logind.conf</code> 加入 <code>HandleLidSwitch=hibernate #合盖休眠</code><br></li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgc09f649" class="outline-2">
<h2 id="orgc09f649">与本文无关/地图炮</h2>
<div class="outline-text-2" id="text-orgc09f649">
<blockquote>
<p>
2020年还在常用桌面环境使用SysVinit的无非两种人，一种是宁可牺牲速度也要让系统略微干净那么一点的，另一种就是喜欢跟风还喜欢装逼的。<br>
</p>
</blockquote>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2020-11-23 Mon 06:04</p>
</div>
</body>
</html>
